XML/Public/RDSQ04/request/body_RDSQ04.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
         <![CDATA[
     <MBS>
    <pub>
        <SRCOUTSYSTEMCODE>NC</SRCOUTSYSTEMCODE>
        <SRCBATCHNO>sandy1105_04</SRCBATCHNO> 
        <TRANSCODE>RDSQ04</TRANSCODE>
        <TRANSDATETIME>2019-10-31 13:47:38</TRANSDATETIME>
        <MD5>123456</MD5>
    </pub>
    <req>
        <list>
            <detail>
                <SRCSERIALNO>txbRDSQ04</SRCSERIALNO>
                <ORGCODE>001000</ORGCODE>
                <DRAFTTYPE>109</DRAFTTYPE>
                <DRAFTCODE>testRDSQ04</DRAFTCODE>
                <DRAFTDATE>2021-02-26</DRAFTDATE>
                <ENDDATE>2023-02-26</ENDDATE>
                <TERMS>29</TERMS>
                <RECPAYOBJECTTYPE>2</RECPAYOBJECTTYPE>
                <RECCOUNTERPARTYNAME>张三</RECCOUNTERPARTYNAME>
                <PAYBANKCODE>BOC</PAYBANKCODE>
                <CURRENCYCODE>CNY</CURRENCYCODE>
                <DRAFTAMOUNT>120.00</DRAFTAMOUNT>
                <BAILTYPE>3</BAILTYPE>
                <BAILAMOUNT>0.00</BAILAMOUNT>
                <BAILRATE>0.00</BAILRATE>
                <DESCRIPTION>开票给交易对手并占用授信</DESCRIPTION>
                <CREDITCODE>12345678922</CREDITCODE>
                <CREDITEXCHANGERATE>1.0000</CREDITEXCHANGERATE>
                <feelist>
                    <feedetail>
                        <FEESNAME>费用001</FEESNAME>
                        <FEESAMOUNT>1.00</FEESAMOUNT>
                        <DESCRIPTION>费用描述1</DESCRIPTION>
                        <FEESDATE>2019-11-04</FEESDATE>
                    </feedetail>
                </feelist>
                <creditlist>
                    <creditdetail>
                        <GUARANTEETYPE>1</GUARANTEETYPE>
                        <GUARANTEECODE/>
                        <TRANSAMOUNT>450.00</TRANSAMOUNT>
                        <DESCRIPTION/>
                    </creditdetail>
                </creditlist>
            </detail>
        </list>
    </req>
</MBS>
         ]]></out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>